prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/esp32_surveillance_detector.ino
// Pred_Ai Guardian — passive ESP32-S3 counter-surveillance scanner (LAFVIN kit).
// Receive-only: listens for WiFi+BLE, flags cameras/trackers, screen+speaker alerts.
// Bare kit needs only Adafruit GFX + Adafruit ST7789. GPS/SD are optional switches.

// ---- optional hardware (leave 0 to run on the bare kit) ----
#define ENABLE_GPS 0     // 1 after wiring a UART GPS + installing TinyGPSPlus
#define ENABLE_SD  0     // 1 after wiring a microSD module

#include <WiFi.h>
#include "esp_wifi.h"
#include <BLEDevice.h>
#include <BLEScan.h>
#include <BLEAdvertisedDevice.h>
#include <esp_random.h>
#include <esp_task_wdt.h>
#include <esp_idf_version.h>
#include <SPI.h>
#include <math.h>
#include <string.h>
#if ENABLE_SD
  #include <SD.h>
#endif
#if ENABLE_GPS
  #include <TinyGPS++.h>
  #include <HardwareSerial.h>
#endif

// ---------------- 2.0" ST7789 TFT (kit display) ----------------
#define ENABLE_TFT 1
#if ENABLE_TFT
  #include <Adafruit_GFX.h>
  #include <Adafruit_ST7789.h>
  #ifndef ST77XX_ORANGE
  #define ST77XX_ORANGE 0xFC00
  #endif
  #define TFT_MOSI 40
  #define TFT_SCLK 41
  #define TFT_CS   47
  #define TFT_DC   39
  #define TFT_RST  4
  #define TFT_BL   42
  Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);
#endif

// ---------------- audio (kit ES8311 codec speaker) ----------------
// Verified LAFVIN pins. NOTE: GPIO48 is the speaker AMP enable (PA), not an LED.
#define ENABLE_AUDIO  1          // 0 = silent (screen+serial only; no extra libs)
#define ENABLE_VOICE  1          // SPEAK alerts/status aloud (needs "ESP8266SAM" lib)
#define PA_EN_PIN     48         // speaker amplifier enable
#define I2S_MCLK_PIN  38
#define I2S_BCLK_PIN  14
#define I2S_WS_PIN    13
#define I2S_DOUT_PIN  45
#define CODEC_SDA_PIN 1
#define CODEC_SCL_PIN 2
#define ES8311_ADDR   0x18
#define AUDIO_RATE    22050

// Optional discrete LED — set to a free GPIO if you wire one (-1 = none).
// (Do NOT use 48: that's the audio amp.)
#define ALERT_LED_PIN -1

// Kit task buttons (active-low). The mic is never used — buttons only RUN TASKS.
#define BTN_SHIELD_PIN 0    // BOOT: RUN ALL — activate the shield (scan+alerts+report)
#define BTN_STATUS_PIN 19   // speak a status summary
#define BTN_MUTE_PIN   20   // mute / unmute alerts

#if ENABLE_AUDIO && (ESP_IDF_VERSION_MAJOR < 5)
  #warning "Audio requires ESP32 Arduino core 3.x (IDF5) — disabling audio."
  #undef ENABLE_AUDIO
  #define ENABLE_AUDIO 0
#endif
#if ENABLE_AUDIO
  #include <Wire.h>
  #include <driver/i2s_std.h>
  i2s_chan_handle_t i2sTx = nullptr;
  bool audioReady = false;
#endif

// ---------------- pins / config ----------------
#define SD_CS_PIN  5            // optional microSD (not in base kit)
#define GPS_RX_PIN 16           // optional GPS
#define GPS_TX_PIN 17
#define GPS_BAUD   9600

#define LOG_PATH   "/sightings.csv"
#define DB_PATH    "/devices.dat"
#define DB_MAGIC   0x50414934UL // bump when struct layout changes
#define BLE_SCAN_SECS 4
#define SCAN_PERIOD   12000UL
#define MAX_DEVICES   180
#define GPS_MAX_AGE_MS 10000UL    // ignore GPS fixes older than this
#define DEVICE_EXPIRE_MS 90000UL  // hide/forget devices not seen for this long
// STRONG UNKNOWN: stricter so your own phone/car BT doesn't false-alarm.
#define STRONG_UNKNOWN_DB    -45  // must be this loud (very close)...
#define STRONG_UNKNOWN_HITS   8   // ...seen this many times...
#define STRONG_UNKNOWN_CYC    5   // ...across this many scan cycles.
// Alerts re-nag: a persistent threat re-alerts every ALERT_REPEAT_MS instead of
// only once, but never faster than ALERT_COOLDOWN_MS.
#define ALERT_COOLDOWN_MS  8000UL
#define ALERT_REPEAT_MS    60000UL

// Receive-only scanning: passive WiFi (no probe requests) + passive BLE (no scan
// requests). Truly listen-only — nothing we do transmits or reveals us.
#define WIFI_PASSIVE_SCAN       true
#define WIFI_SCAN_MS_PER_CHAN   250
#define BLE_ACTIVE_SCAN         false

// --- following / approaching tuning (raise thresholds = fewer false alarms) ---
#define MOVE_METERS        75.0     // GPS: moved this far with you => following
#define APPROACH_DB        10       // signal must climb this many dB...
#define APPROACH_MIN_CYC   4        // ...across at least this many scan cycles...
#define APPROACH_MIN_MS    60000UL  // ...over at least this long (transient filter)
#define EMA_ALPHA          0.40f    // RSSI smoothing (kills single-sample spikes)

#if ENABLE_GPS
TinyGPSPlus gps;
HardwareSerial gpsSerial(1);
#endif

// ---------------- original globals (kept) ----------------
bool activeMode = false;        // "shield/activate" word (no transmit in this build)
bool scanningEnabled = true;
bool alertsEnabled = true;
bool stealthMode = false;       // blank screen + mute + slower scan (don't be seen)
unsigned long lastLogTime = 0;
unsigned long lastScan = 0;
uint16_t scanCycle = 0;
int currentChannel = 0;
String currentPattern = "Crowd";

double realLat = 0.0, realLon = 0.0;
double reportedLat = 0.0, reportedLon = 0.0;

String commandHistory[10];
int historyIndex = 0;
const uint8_t KEY = 0xA5;        // XOR command key (kept)

File logFile;
bool sdReady = false;
bool gpsFix = false;
double curLat = 0.0, curLon = 0.0;
BLEScan* pBLEScan = nullptr;

// TFT auto-dim (saves battery on a portable build)
bool tftDimmed = false;
uint32_t lastTFTActivity = 0;

// ---------------- vendor OUI table (camera / IoT / tracker) ----------------
// risk: 2 = camera-likely, 1 = IoT/tracker/info. Expand from the IEEE registry
// or maclookup.app. (Randomized MACs are skipped — their vendor bits are noise.)
struct OuiEntry { uint8_t oui[3]; const char* name; uint8_t risk; };
const OuiEntry OUI_TABLE[] = {
  // Axis
  {{0x00,0x40,0x8C},"Axis cam",2},{{0xAC,0xCC,0x8E},"Axis cam",2},{{0xB8,0xA4,0x4F},"Axis cam",2},
  // Hikvision
  {{0x44,0x19,0xB6},"Hikvision",2},{{0xBC,0xAD,0x28},"Hikvision",2},{{0xC0,0x56,0xE3},"Hikvision",2},
  {{0x4C,0xBD,0x8F},"Hikvision",2},{{0x28,0x57,0xBE},"Hikvision",2},{{0x54,0xC4,0x15},"Hikvision",2},
  // Dahua
  {{0x3C,0xEF,0x8C},"Dahua",2},{{0x90,0x02,0xA9},"Dahua",2},{{0x14,0xA7,0x8B},"Dahua",2},{{0xE0,0x50,0x8B},"Dahua",2},
  // Reolink / Amcrest / Wyze
  {{0xEC,0x71,0xDB},"Reolink",2},{{0x9C,0x8E,0xCD},"Amcrest",2},{{0x3C,0xE3,0x6B},"Amcrest",2},
  {{0x2C,0xAA,0x8E},"Wyze",2},{{0x7C,0x78,0xB2},"Wyze",2},
  // Ubiquiti UniFi cams
  {{0x04,0x18,0xD6},"Ubiquiti",2},{{0x24,0xA4,0x3C},"Ubiquiti",2},{{0x68,0x72,0x51},"Ubiquiti",2},
  {{0x78,0x8A,0x20},"Ubiquiti",2},{{0xFC,0xEC,0xDA},"Ubiquiti",2},{{0x44,0xD9,0xE7},"Ubiquiti",2},
  // Nest / Google
  {{0x18,0xB4,0x30},"Nest/Google",2},{{0x64,0x16,0x66},"Nest/Google",2},{{0x6C,0xAD,0xF8},"Nest/Google",2},
  {{0x1C,0xF2,0x9A},"Nest/Google",2},{{0x30,0xFD,0x38},"Nest/Google",2},
  // Amazon / Ring
  {{0x34,0xD2,0x70},"Ring/Amazon",2},{{0x44,0x65,0x0D},"Ring/Amazon",2},{{0x0C,0x47,0xC9},"Ring/Amazon",2},
  {{0xFC,0x65,0xDE},"Ring/Amazon",2},{{0x68,0x54,0xFD},"Ring/Amazon",2},{{0xAC,0x63,0xBE},"Ring/Amazon",2},
  // TP-Link / Tapo
  {{0x50,0xC7,0xBF},"TP-Link/Tapo",2},{{0x60,0x32,0xB1},"TP-Link/Tapo",2},{{0xA4,0x2B,0xB0},"TP-Link/Tapo",2},
  {{0x30,0xDE,0x4B},"TP-Link/Tapo",2},{{0x5C,0x62,0x8B},"TP-Link/Tapo",2},
  // D-Link
  {{0x00,0x1B,0x11},"D-Link",2},{{0x14,0xD6,0x4D},"D-Link",2},{{0xB0,0xC5,0x54},"D-Link",2},{{0x28,0x10,0x7B},"D-Link",2},
  // Xiaomi (Mi/Dafang)
  {{0x28,0x6C,0x07},"Xiaomi cam",2},{{0x34,0xCE,0x00},"Xiaomi cam",2},{{0x50,0xEC,0x50},"Xiaomi cam",2},
  {{0x64,0x09,0x80},"Xiaomi cam",2},{{0x78,0x11,0xDC},"Xiaomi cam",2},{{0xF0,0xB4,0x29},"Xiaomi cam",2},
  // Arlo / Netgear
  {{0xF0,0x18,0x98},"Arlo/Netgear",2},{{0x9C,0x3D,0xCF},"Arlo/Netgear",2},
  // Tuya white-label cams
  {{0x10,0x5A,0x17},"Tuya cam",2},{{0x50,0x02,0x91},"Tuya cam",2},{{0x68,0x57,0x2D},"Tuya cam",2},
  // Espressif (DIY ESP32-CAM are common in hidden cams) — info tier
  {{0x24,0x0A,0xC4},"Espressif/ESP-CAM?",1},{{0x30,0xAE,0xA4},"Espressif/ESP-CAM?",1},
  {{0x7C,0x9E,0xBD},"Espressif/ESP-CAM?",1},{{0xA4,0xCF,0x12},"Espressif/ESP-CAM?",1},
  {{0xEC,0x94,0xCB},"Espressif/ESP-CAM?",1},{{0xCC,0x50,0xE3},"Espressif/ESP-CAM?",1},
};
