prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/esp32_surveillance_detector.ino
const int OUI_COUNT = sizeof(OUI_TABLE)/sizeof(OUI_TABLE[0]);

// SSID substrings that strongly suggest a camera/NVR (lowercased compare).
const char* SSID_KEYWORDS[] = {
  "ipcam","ipc-","ipc_","hikvision","hik-","dahua","reolink","wyze","tapo","ezviz",
  "foscam","amcrest","arlo","lorex","swann","annke","vivotek","unifi","instar",
  "camera","doorbell","babymonitor","nvr-","dvr-","yicam","goprocam"
};
const int SSID_KW_COUNT = sizeof(SSID_KEYWORDS)/sizeof(SSID_KEYWORDS[0]);

// BLE advertised-name substrings that suggest a tracker/camera.
const char* BLE_KEYWORDS[] = {
  "airtag","tile","smarttag","chipolo","trackr","itag","find my","gps tracker",
  "wyze","reolink","ring","nest cam","camera"
};
const int BLE_KW_COUNT = sizeof(BLE_KEYWORDS)/sizeof(BLE_KEYWORDS[0]);

// ---------------- tracking table ----------------
struct Sighting {
  uint8_t  mac[6];
  bool     isBle;
  int8_t   firstRssi;
  int8_t   bestRssi;
  float    emaRssi;       // smoothed signal
  uint16_t hits;
  uint16_t cycles;        // distinct scan cycles seen in
  uint16_t lastCycle;
  uint32_t firstSeenMs;
  uint32_t lastSeenMs;
  double   firstLat, firstLon, lastLat, lastLon;
  bool     mobileFlag;    // GPS: moved with you
  bool     approachFlag;  // signal rose over time
  bool     vendorFlag;    // matched vendor/keyword (shown)
  bool     strongUnknownFlag; // very close + repeated unknown
  bool     alertWorthy;   // camera-grade vendor or following (alerts)
  uint32_t lastAlertMs;   // last time we alerted on this device (re-nag timer)
  char     label[24];
};
Sighting devices[MAX_DEVICES];
int deviceCount = 0;

// ---------------- helpers ----------------
double haversineMeters(double a1,double o1,double a2,double o2){
  const double R=6371000.0; double dA=radians(a2-a1), dO=radians(o2-o1);
  double a=sin(dA/2)*sin(dA/2)+cos(radians(a1))*cos(radians(a2))*sin(dO/2)*sin(dO/2);
  return R*2*atan2(sqrt(a),sqrt(1-a));
}
String macToStr(const uint8_t* m){char b[18];sprintf(b,"%02X:%02X:%02X:%02X:%02X:%02X",m[0],m[1],m[2],m[3],m[4],m[5]);return String(b);}
void safeCopy(char* dst,const char* src,size_t n){ if(!dst||!n)return; if(!src)src=""; strncpy(dst,src,n-1); dst[n-1]='\0'; }
// quote a CSV field so SSIDs with commas/quotes can't corrupt the log
String csvEscape(const String& in){ String o="\""; for(size_t i=0;i<in.length();i++){char c=in[i]; if(c=='"')o+="\"\""; else o+=c;} o+="\""; return o; }
String getTimestamp(){
#if ENABLE_GPS
  if(gps.date.isValid()&&gps.time.isValid()&&gps.time.age()<GPS_MAX_AGE_MS){char b[32];
    sprintf(b,"%04d-%02d-%02dT%02d:%02d:%02dZ",gps.date.year(),gps.date.month(),gps.date.day(),gps.time.hour(),gps.time.minute(),gps.time.second());
    return String(b);}
#endif
  return String(millis()/1000)+"s";
}
bool isRandomMac(const uint8_t* m){return (m[0]&0x02)!=0;}
int lookupOui(const uint8_t* m){
  if(isRandomMac(m))return -1;
  for(int i=0;i<OUI_COUNT;i++)
    if(m[0]==OUI_TABLE[i].oui[0]&&m[1]==OUI_TABLE[i].oui[1]&&m[2]==OUI_TABLE[i].oui[2])return i;
  return -1;
}
// returns matched keyword index or -1 (haystack must be lowercase)
int matchKeyword(const String& hay,const char** table,int count){
  for(int i=0;i<count;i++) if(hay.indexOf(table[i])>=0) return i;
  return -1;
}
// a device is "fresh" if seen recently (stale ones drop off screen/counts)
bool isFresh(const Sighting* s){ return (uint32_t)(millis()-s->lastSeenMs) <= DEVICE_EXPIRE_MS; }

// ---------------- XOR crypto + history (kept) ----------------
String encryptCommand(String cmd){String e=cmd;for(unsigned i=0;i<e.length();i++)e[i]=e[i]^KEY;return e;}
String decryptCommand(String e){String d=e;for(unsigned i=0;i<d.length();i++)d[i]=d[i]^KEY;return d;}
bool isRepeatCommand(String c){for(int i=0;i<10;i++)if(commandHistory[i]==c)return true;return false;}
void addToHistory(String c){commandHistory[historyIndex]=c;historyIndex=(historyIndex+1)%10;}

// ---------------- scramble + status log (kept) ----------------
void scrambleGPS(){
#if ENABLE_GPS
  if(gps.location.isValid()){
    double nLat=(random(-150,150)/100000.0)*1.5;
    double nLon=(random(-150,150)/100000.0)*1.5;
    reportedLat=realLat+nLat; reportedLon=realLon+nLon;
  }
#endif
}
void logStatusToSD(){
  scrambleGPS();
  // periodic heartbeat to serial (heap watch catches slow leaks over a long drive)
  int fresh=0,flagged=0;
  for(int i=0;i<deviceCount;i++){ if(!isFresh(&devices[i]))continue; fresh++; if(devices[i].alertWorthy)flagged++; }
  Serial.printf("STATUS seen=%d fresh=%d flagged=%d alerts=%s stealth=%s heap=%u/%u\n",
    deviceCount,fresh,flagged,alertsEnabled?"ON":"MUTE",stealthMode?"ON":"OFF",
    (unsigned)ESP.getFreeHeap(),(unsigned)ESP.getMinFreeHeap());
#if ENABLE_SD
  if(!sdReady)return;
  logFile=SD.open("/guardian.log",FILE_APPEND);
  if(logFile){
    logFile.printf("[%s] Scan:%s Alerts:%s Devices:%d Real:%.6f,%.6f Reported:%.6f,%.6f\n",
      getTimestamp().c_str(),scanningEnabled?"YES":"NO",alertsEnabled?"YES":"NO",deviceCount,
      realLat,realLon,reportedLat,reportedLon);
    logFile.close();
  }
#endif
}

// ---------------- persistence (SD only) ----------------
#if ENABLE_SD
void saveTable(){
  if(!sdReady)return;
  File f=SD.open(DB_PATH,FILE_WRITE); if(!f)return;
  uint32_t magic=DB_MAGIC; f.write((const uint8_t*)&magic,sizeof(magic));
  f.write((const uint8_t*)&deviceCount,sizeof(deviceCount));
  if(deviceCount>0) f.write((const uint8_t*)devices,sizeof(Sighting)*deviceCount);
  f.close();
}
void loadTable(){
  if(!sdReady||!SD.exists(DB_PATH))return;
  File f=SD.open(DB_PATH,FILE_READ); if(!f)return;
  uint32_t magic=0; int count=0;
  if(f.read((uint8_t*)&magic,sizeof(magic))==sizeof(magic)&&magic==DB_MAGIC&&
     f.read((uint8_t*)&count,sizeof(count))==sizeof(count)&&count>=0&&count<=MAX_DEVICES){
    if(f.read((uint8_t*)devices,sizeof(Sighting)*count)==(int)(sizeof(Sighting)*count))deviceCount=count;
  } else Serial.println("Old/incompatible device DB ignored.");
  f.close();
  Serial.printf("Loaded %d remembered devices.\n",deviceCount);
}
#else
void saveTable(){}
void loadTable(){}
#endif

// ---------------- audio (ES8311 codec + I2S tones) ----------------
#if ENABLE_AUDIO
void es8311W(uint8_t r,uint8_t v){Wire.beginTransmission(ES8311_ADDR);Wire.write(r);Wire.write(v);Wire.endTransmission();}
bool es8311Probe(){Wire.beginTransmission(ES8311_ADDR);return Wire.endTransmission()==0;}

