prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/esp32_surveillance_detector.ino
void audioInit(){
  pinMode(PA_EN_PIN,OUTPUT); digitalWrite(PA_EN_PIN,LOW);   // amp off until ready
  Wire.begin(CODEC_SDA_PIN,CODEC_SCL_PIN,100000);
  if(!es8311Probe()){
    Serial.println("[AUDIO] ES8311 not found at 0x18 (check I2C) — audio off");
    audioReady=false; return;
  }
  // minimal ES8311 playback init (MCLK provided by I2S on pin 38)
  es8311W(0x00,0x1F); delay(20); es8311W(0x00,0x00); delay(10);
  es8311W(0x01,0x30); es8311W(0x02,0x10); es8311W(0x03,0x10); es8311W(0x16,0x24);
  es8311W(0x04,0x10); es8311W(0x05,0x00); es8311W(0x0B,0x00); es8311W(0x0C,0x00);
  es8311W(0x10,0x1F); es8311W(0x11,0x7F); es8311W(0x00,0x80);
  es8311W(0x0D,0x01); es8311W(0x0E,0x02); es8311W(0x12,0x00); es8311W(0x13,0x10);
  es8311W(0x32,0xBF); es8311W(0x37,0x08); es8311W(0x44,0x08); es8311W(0x45,0x00);

  i2s_chan_config_t cc = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_0, I2S_ROLE_MASTER);
  if(i2s_new_channel(&cc,&i2sTx,NULL)!=ESP_OK){audioReady=false;return;}
  i2s_std_config_t sc = {
    .clk_cfg  = I2S_STD_CLK_DEFAULT_CONFIG(AUDIO_RATE),
    .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO),
    .gpio_cfg = { .mclk=(gpio_num_t)I2S_MCLK_PIN, .bclk=(gpio_num_t)I2S_BCLK_PIN,
                  .ws=(gpio_num_t)I2S_WS_PIN, .dout=(gpio_num_t)I2S_DOUT_PIN,
                  .din=I2S_GPIO_UNUSED, .invert_flags={false,false,false} },
  };
  if(i2s_channel_init_std_mode(i2sTx,&sc)!=ESP_OK){audioReady=false;return;}
  i2s_channel_enable(i2sTx);
  digitalWrite(PA_EN_PIN,HIGH);   // amp on
  audioReady=true;
  Serial.println("[AUDIO] ES8311 + I2S ready");
}
void audioTone(int freq,int ms,float vol){
  if(!audioReady)return;
  long total=(long)AUDIO_RATE*ms/1000; int16_t buf[256];
  float ph=0, inc=2.0f*PI*freq/AUDIO_RATE; long done=0;
  while(done<total){
    int n=(int)min((long)256,total-done);
    for(int i=0;i<n;i++){buf[i]=(int16_t)(sinf(ph)*32767.0f*vol); ph+=inc; if(ph>2*PI)ph-=2*PI;}
    size_t wr; i2s_channel_write(i2sTx,buf,n*sizeof(int16_t),&wr,100);
    done+=n;
  }
}
void audioGap(int ms){
  if(!audioReady)return;
  long total=(long)AUDIO_RATE*ms/1000; int16_t z[256]={0}; long done=0;
  while(done<total){int n=(int)min((long)256,total-done);size_t wr;i2s_channel_write(i2sTx,z,n*sizeof(int16_t),&wr,100);done+=n;}
}
void audioBoot(){ audioTone(880,120,0.5f); audioTone(1320,150,0.5f); }
// kind: 0 camera/tracker, 1 following, 2 approaching
void audioAlert(int kind){
  if(!audioReady)return;
  if(kind==1){ for(int i=0;i<3;i++){audioTone(1500,150,0.85f);audioGap(70);} }      // urgent triple
  else if(kind==2){ audioTone(1150,180,0.75f);audioGap(60);audioTone(1600,180,0.75f);} // rising couplet
  else { audioTone(1000,200,0.75f);audioGap(60);audioTone(1000,200,0.75f); }          // double beep
}

// ---- optional spoken voice (ESP8266SAM) reusing the same I2S channel ----
#if ENABLE_VOICE
#include "AudioOutput.h"     // from the ESP8266Audio library (dep of ESP8266SAM)
#include <ESP8266SAM.h>
// Sink that feeds SAM's samples straight into our ES8311 I2S channel.
class I2SSpeechSink : public AudioOutput {
 public:
  bool begin() override { return true; }
  bool ConsumeSample(int16_t sample[2]) override {
    if(!audioReady) return false;
    int16_t mono = sample[0];
    size_t wr; i2s_channel_write(i2sTx, &mono, sizeof(mono), &wr, 50);
    return true;
  }
  bool stop() override { return true; }
};
I2SSpeechSink* speechSink = nullptr;
#endif

// Speak the phrase if voice is enabled+ready; otherwise play the tone pattern.
void alertSound(int kind,const char* phrase){
#if ENABLE_VOICE
  if(audioReady && speechSink){            // attention chirp, then speak the alert
    audioTone(1500,120,0.8f); audioGap(60);
    ESP8266SAM sam; sam.Say(speechSink, phrase); return;
  }
#else
  (void)phrase;
#endif
  audioAlert(kind);
}
// Speak arbitrary text (status, replies, the `say` command). Chirps if no voice.
void voiceSay(const char* text){
#if ENABLE_VOICE
  if(audioReady && speechSink){ ESP8266SAM sam; sam.Say(speechSink, text); return; }
#else
  (void)text;
#endif
  if(audioReady) audioTone(1200,120,0.6f);
}
#endif // ENABLE_AUDIO

// ---------------- TFT ----------------
#if ENABLE_TFT
bool isFollowing(const Sighting* s){return s->mobileFlag||s->approachFlag;}
void tftBanner(const char* t,uint16_t c){tft.fillRect(0,0,tft.width(),22,c);tft.setTextColor(ST77XX_BLACK,c);tft.setTextSize(2);tft.setCursor(4,4);tft.print(t);}
void tftWake(){ if(tftDimmed){digitalWrite(TFT_BL,HIGH);tftDimmed=false;} lastTFTActivity=millis(); }
void tftDim(){ if(!tftDimmed){digitalWrite(TFT_BL,LOW);tftDimmed=true;} }
void drawScreen(){
  if(stealthMode){ tft.fillScreen(ST77XX_BLACK); return; }   // dark = don't be seen
  tftWake();
  int fl=0; for(int i=0;i<deviceCount;i++) if(isFresh(&devices[i])&&devices[i].alertWorthy)fl++;
  tft.fillScreen(ST77XX_BLACK);
  char h[40]; snprintf(h,sizeof(h),"Pred_Ai  %d flagged",fl);
  tftBanner(h, fl?ST77XX_RED:ST77XX_GREEN);
  tft.setTextSize(1); int y=28;
  for(int i=0;i<deviceCount&&y<tft.height()-12;i++){
    Sighting* s=&devices[i]; if(!isFresh(s)||!s->alertWorthy)continue;
    const char* tag; uint16_t col;
    if(isFollowing(s)){ tag=s->mobileFlag?"FOLLOW":"APPRCH"; col=ST77XX_RED; }
    else if(s->strongUnknownFlag){ tag="STRONG"; col=ST77XX_ORANGE; }
    else { tag="VENDOR"; col=ST77XX_YELLOW; }
    tft.setTextColor(col,ST77XX_BLACK);
    tft.setCursor(2,y); tft.printf("%-6s %-15s %ddB",tag,s->label,s->bestRssi); y+=11;
  }
  tft.setTextColor(ST77XX_WHITE,ST77XX_BLACK); tft.setCursor(2,tft.height()-10);
  tft.printf("seen:%d GPS:%s SD:%s",deviceCount,gpsFix?"Y":"N",sdReady?"Y":"N");
}
void tftAlertFlash(){tft.fillScreen(ST77XX_RED);delay(150);}
// Full-screen alert that spells out the threat.
void tftAlertScreen(const char* title,const Sighting* s){
  tft.fillScreen(ST77XX_RED);
  tft.setTextColor(ST77XX_WHITE,ST77XX_RED);
  tft.setTextSize(3); tft.setCursor(8,12);  tft.print("! ALERT");
  tft.setTextSize(2); tft.setCursor(8,56);  tft.print(title);
  tft.setTextSize(1);
  tft.setCursor(8,92);  tft.printf("%s   %d dB", s->label, s->bestRssi);
  tft.setCursor(8,108); tft.printf("%s  %s", s->isBle?"BLE":"WIFI", macToStr(s->mac).c_str());
  tft.setCursor(8,132); tft.print(getTimestamp());
  delay(1400);
}
#endif

// ---------------- alerts ----------------
void ledBlink(){
  if(ALERT_LED_PIN<0)return;
  for(int i=0;i<6;i++){digitalWrite(ALERT_LED_PIN,HIGH);delay(90);digitalWrite(ALERT_LED_PIN,LOW);delay(90);}
}
void raiseAlert(Sighting* s,const char* reason){
  uint32_t now=millis();
  if(s->lastAlertMs && (now - s->lastAlertMs) < ALERT_COOLDOWN_MS) return;  // don't spam
  s->lastAlertMs = now;
  Serial.printf("*** ALERT%s: %s %s %s [%s] rssi=%d @ %.6f,%.6f %s\n",
    alertsEnabled?"":" (muted)",reason,s->isBle?"BLE":"WIFI",macToStr(s->mac).c_str(),s->label,s->bestRssi,curLat,curLon,getTimestamp().c_str());
  if(!alertsEnabled||stealthMode)return;
  int kind = s->mobileFlag?1 : (s->approachFlag?2:0);
  const char* title = s->mobileFlag    ? "FOLLOWING YOU"
                    : s->approachFlag  ? "APPROACHING YOU"
                                       : "CAMERA / TRACKER";
#if ENABLE_TFT
  tftWake();
  tftAlertScreen(title,s);
#endif
#if ENABLE_AUDIO
  const char* phrase = s->mobileFlag   ? "Warning. A device is following you."
                     : s->approachFlag ? "Warning. A device is approaching."
                                       : "Camera or tracker detected.";
  alertSound(kind, phrase);
#endif
  ledBlink();
}

// ---------------- record + log ----------------
void logSighting(Sighting* s,int rssi){
  String flag="";
  if(s->vendorFlag)flag+="VENDOR ";
  if(s->mobileFlag)flag+="FOLLOWING ";
  if(s->approachFlag)flag+="APPROACHING ";
  if(flag=="")flag="-";
  String line=getTimestamp()+","+String(curLat,6)+","+String(curLon,6)+","+
    (s->isBle?"BLE":"WIFI")+","+macToStr(s->mac)+","+csvEscape(String(s->label))+","+
    String(rssi)+","+String(s->hits)+","+flag;
  Serial.println(line);
#if ENABLE_SD
  if(sdReady){File f=SD.open(LOG_PATH,FILE_APPEND);if(f){f.println(line);f.close();}}
#endif
}

