prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/esp32_surveillance_detector.ino
// find existing, else allocate (evicting the oldest non-flagged when full)
Sighting* getSlot(const uint8_t* mac,bool isBle){
  for(int i=0;i<deviceCount;i++)
    if(devices[i].isBle==isBle&&memcmp(devices[i].mac,mac,6)==0) return &devices[i];
  if(deviceCount<MAX_DEVICES) return &devices[deviceCount++];
  // table full: recycle the oldest device that isn't flagged
  int victim=-1; uint32_t oldest=0xFFFFFFFF;
  for(int i=0;i<deviceCount;i++){
    if(devices[i].vendorFlag||devices[i].mobileFlag||devices[i].approachFlag)continue;
    if(devices[i].lastSeenMs<oldest){oldest=devices[i].lastSeenMs;victim=i;}
  }
  return (victim>=0)?&devices[victim]:nullptr;  // all flagged => drop new
}

// risk: 0 none, 1 info/IoT, 2 camera-grade
void recordDevice(const uint8_t* mac,bool isBle,int rssi,const char* label,int risk){
  uint32_t now=millis();
  Sighting* s=getSlot(mac,isBle);
  if(!s)return;
  bool isNew = !(s->isBle==isBle && memcmp(s->mac,mac,6)==0 && s->hits>0);
  if(isNew){
    memset(s,0,sizeof(*s));
    memcpy(s->mac,mac,6); s->isBle=isBle;
    s->firstRssi=rssi; s->bestRssi=rssi; s->emaRssi=rssi;
    s->firstSeenMs=now; s->firstLat=curLat; s->firstLon=curLon;
    s->lastCycle=scanCycle-1;
    safeCopy(s->label,label,sizeof(s->label));
  }
  s->hits++;
  s->lastSeenMs=now; s->lastLat=curLat; s->lastLon=curLon;
  if(rssi>s->bestRssi)s->bestRssi=rssi;
  s->emaRssi += EMA_ALPHA*(rssi - s->emaRssi);
  if(s->lastCycle!=scanCycle){s->cycles++;s->lastCycle=scanCycle;}
  // Only camera-grade (risk 2) becomes a flagged vendor; risk-1 (Apple/Samsung/
  // Espressif) just gets a label so your own gear isn't treated as a threat.
  if(risk>=2){s->vendorFlag=true; if(label[0])safeCopy(s->label,label,sizeof(s->label));}
  else if(risk==1 && label[0]) safeCopy(s->label,label,sizeof(s->label));

  // FOLLOWING (GPS): moved with you, sustained over cycles + time
  if(gpsFix && s->cycles>=APPROACH_MIN_CYC && (now-s->firstSeenMs)>=APPROACH_MIN_MS &&
     haversineMeters(s->firstLat,s->firstLon,curLat,curLon)>MOVE_METERS)
    s->mobileFlag=true;

  // APPROACHING (no GPS): smoothed signal climbed, sustained over cycles + time
  if(s->cycles>=APPROACH_MIN_CYC && (now-s->firstSeenMs)>=APPROACH_MIN_MS &&
     (s->emaRssi - s->firstRssi)>=APPROACH_DB && s->bestRssi>-75)
    s->approachFlag=true;

  // STRONG UNKNOWN: not a known vendor, but very close AND seen many times across
  // several cycles — strict thresholds so your own phone/car BT doesn't trip it.
  if(risk==0 && s->hits>=STRONG_UNKNOWN_HITS && s->cycles>=STRONG_UNKNOWN_CYC && s->bestRssi>=STRONG_UNKNOWN_DB){
    s->strongUnknownFlag=true;
    if(!s->vendorFlag) safeCopy(s->label, isBle?"strong unknown(BLE)":"strong unknown(WiFi)", sizeof(s->label));
  }

  bool wasWorthy = s->alertWorthy;
  s->alertWorthy = (risk>=2) || s->mobileFlag || s->approachFlag || s->strongUnknownFlag;
  logSighting(s,rssi);
  // Alert when it first becomes a threat, then re-nag every ALERT_REPEAT_MS so a
  // device that keeps following you doesn't go silent after one beep.
  if(s->alertWorthy){
    bool became = !wasWorthy && s->alertWorthy;
    if(became || (now - s->lastAlertMs) > ALERT_REPEAT_MS){
      raiseAlert(s, s->mobileFlag?"FOLLOWING (moved with you)"
                  : s->approachFlag?"APPROACHING (signal rising)"
                  : s->strongUnknownFlag?"strong unknown nearby"
                  : "camera-grade device");
    }
  }
}

// ---------------- scans ----------------
void scanWifi(){
  // passive scan = listen for beacons only, never send probe requests
  int n=WiFi.scanNetworks(false,true,WIFI_PASSIVE_SCAN,WIFI_SCAN_MS_PER_CHAN);
  if(n<=0){WiFi.scanDelete();return;}
  for(int i=0;i<n;i++){
    uint8_t* b=WiFi.BSSID(i); if(!b)continue;
    char label[24]; int risk=0;
    int oui=lookupOui(b);
    String ssid=WiFi.SSID(i); String low=ssid; low.toLowerCase();
    int kw=matchKeyword(low,SSID_KEYWORDS,SSID_KW_COUNT);
    if(kw>=0){ risk=2; snprintf(label,sizeof(label),"cam:%s",SSID_KEYWORDS[kw]); }
    else if(oui>=0){ risk=OUI_TABLE[oui].risk; strncpy(label,OUI_TABLE[oui].name,sizeof(label)-1); label[sizeof(label)-1]='\0'; }
    else if(ssid.length()>0){ snprintf(label,sizeof(label),"wifi:%s",ssid.c_str()); }
    else { strcpy(label,"wifi:<hidden>"); }
    recordDevice(b,false,WiFi.RSSI(i),label,risk);
  }
  WiFi.scanDelete();
}
void performPassiveScan(){   // original name kept; real BLE detection
  BLEScanResults* r=pBLEScan->start(BLE_SCAN_SECS,false);
  int n=r->getCount();
  for(int i=0;i<n;i++){
    BLEAdvertisedDevice d=r->getDevice(i);
    BLEAddress addr=d.getAddress();            // keep alive (getNative() points into it)
    uint8_t native[6]; memcpy(native,addr.getNative(),6);
    char label[24]="ble"; int risk=0;
    if(d.haveManufacturerData()){
      String md=d.getManufacturerData();
      if(md.length()>=2){
        uint16_t co=(uint8_t)md[0]|((uint8_t)md[1]<<8);
        if(co==0x004C){
          if(md.length()>=4&&(uint8_t)md[2]==0x12){strncpy(label,"AirTag/FindMy?",23);risk=2;}
          else strncpy(label,"Apple BLE",23);
        } else if(co==0x0075) strncpy(label,"Samsung BLE",23);
        label[23]='\0';
      }
    }
    if(d.haveServiceUUID()){
      String u=d.getServiceUUID().toString().c_str();
      if(u.indexOf("feed")>=0||u.indexOf("feec")>=0){strcpy(label,"Tile tracker");risk=2;}
      else if(u.indexOf("fd5a")>=0){strcpy(label,"Samsung SmartTag");risk=2;}
    }
    if(d.haveName()&&d.getName().length()>0){
      String nm=d.getName().c_str(); String low=nm; low.toLowerCase();
      int kw=matchKeyword(low,BLE_KEYWORDS,BLE_KW_COUNT);
      if(kw>=0){snprintf(label,sizeof(label),"trk:%s",BLE_KEYWORDS[kw]);risk=2;}
      else if(risk==0)snprintf(label,sizeof(label),"ble:%s",nm.c_str());
    }
    recordDevice(native,true,d.getRSSI(),label,risk);
  }
  pBLEScan->clearResults();
}

// ---------------- spoken status + buttons ----------------
void speakStatus(){
  int cams=0,trk=0,follow=0;
  for(int i=0;i<deviceCount;i++){ Sighting* s=&devices[i];
    if(!isFresh(s)) continue;
    if(s->mobileFlag||s->approachFlag) follow++;
    else if(s->vendorFlag){ if(s->isBle) trk++; else cams++; }
  }
  char phrase[110];
  snprintf(phrase,sizeof(phrase),"Status. %d cameras. %d trackers. %d devices following you.",cams,trk,follow);
  Serial.println(phrase);
#if ENABLE_TFT
  tftWake();
  tft.fillScreen(ST77XX_BLACK); tftBanner("STATUS", follow?ST77XX_RED:ST77XX_GREEN);
  tft.setTextColor(ST77XX_WHITE,ST77XX_BLACK); tft.setTextSize(2);
  tft.setCursor(8,40);  tft.printf("Cameras:  %d",cams);
  tft.setCursor(8,72);  tft.printf("Trackers: %d",trk);
  tft.setCursor(8,104); tft.printf("Following:%d",follow);
  delay(300);
#endif
#if ENABLE_AUDIO
  voiceSay(phrase);
#endif
}
// RUN ALL: arm the whole system, announce it, scan immediately, report.
void activateShield(){
  scanningEnabled=true; alertsEnabled=true;
  Serial.println("SHIELD ACTIVATED — scanning + alerts ON");
#if ENABLE_TFT
  tftWake();
  tft.fillScreen(ST77XX_BLACK); tftBanner("SHIELD ON",ST77XX_GREEN); delay(300);
#endif
#if ENABLE_AUDIO
  voiceSay("Shield activated. Scanning for cameras and trackers.");
#endif
  scanCycle++; scanWifi(); performPassiveScan();   // instant readout, no waiting
  speakStatus();
}
// Task buttons (debounced, active-low). Mic is never used — press = run a task.
void pollButtons(){
  static uint32_t last=0;
  if(millis()-last<350) return;
  bool any = (digitalRead(BTN_SHIELD_PIN)==LOW)||(digitalRead(BTN_STATUS_PIN)==LOW)||(digitalRead(BTN_MUTE_PIN)==LOW);
#if ENABLE_TFT
  if(any) tftWake();
#endif
  if(digitalRead(BTN_SHIELD_PIN)==LOW){ last=millis(); activateShield(); }
  else if(digitalRead(BTN_STATUS_PIN)==LOW){ last=millis(); speakStatus(); }
  else if(digitalRead(BTN_MUTE_PIN)==LOW){ last=millis(); alertsEnabled=!alertsEnabled;
    Serial.printf("Alerts %s\n",alertsEnabled?"ON":"OFF");
#if ENABLE_AUDIO
    voiceSay(alertsEnabled?"Alerts on.":"Alerts muted.");
#endif
  }
}

// ---------------- serial commands ----------------
void printDevice(const Sighting* s){
  bool f=s->vendorFlag||s->mobileFlag||s->approachFlag;
  Serial.printf("  %s %s rssi=%d ema=%.0f hits=%u cyc=%u %s%s%s%s [%s]\n",
    s->isBle?"BLE ":"WIFI",macToStr(s->mac).c_str(),s->bestRssi,s->emaRssi,s->hits,s->cycles,
    s->vendorFlag?"VENDOR ":"",s->mobileFlag?"FOLLOWING ":"",s->approachFlag?"APPROACHING ":"",f?"":"-",s->label);
}
bool handleReview(String c){
  c.trim(); c.toLowerCase();
  if(c=="help"||c=="?"){Serial.println("shield | status | mute | stealth | list | flagged | gps | say <text> | save | clear | testalert");return true;}
  if(c=="shield"||c=="runall"||c=="activate"){ activateShield(); return true; }
  if(c=="stealth"){ stealthMode=!stealthMode; alertsEnabled=!stealthMode;
#if ENABLE_TFT
    if(stealthMode) tft.fillScreen(ST77XX_BLACK); else drawScreen();
#endif
    Serial.printf("Stealth %s (screen %s, alerts %s)\n",stealthMode?"ON":"OFF",stealthMode?"dark":"on",alertsEnabled?"on":"muted"); return true; }
  if(c=="status"||c=="sum"){ speakStatus(); return true; }
  if(c=="mute"){ alertsEnabled=!alertsEnabled; Serial.printf("Alerts %s\n",alertsEnabled?"ON":"OFF"); return true; }
  if(c.startsWith("say ")){ String t=c.substring(4);
#if ENABLE_AUDIO
    voiceSay(t.c_str());
#endif
    Serial.println("(said)"); return true; }
  if(c=="list"){Serial.printf("== %d devices ==\n",deviceCount);for(int i=0;i<deviceCount;i++)printDevice(&devices[i]);return true;}
  if(c=="flagged"){int n=0;for(int i=0;i<deviceCount;i++)if(devices[i].vendorFlag||devices[i].mobileFlag||devices[i].approachFlag){printDevice(&devices[i]);n++;}Serial.printf("(%d flagged)\n",n);return true;}
  if(c=="gps"){
#if ENABLE_GPS
    Serial.printf("GPS fix=%s lat=%.6f lon=%.6f sats=%d\n",gpsFix?"yes":"no",curLat,curLon,gps.satellites.isValid()?gps.satellites.value():0);
#else
    Serial.println("GPS disabled (set ENABLE_GPS 1 after wiring a GPS module).");
#endif
    return true;}
  if(c=="save"){saveTable();Serial.println("Saved.");return true;}
  if(c=="clear"){deviceCount=0;saveTable();Serial.println("Cleared.");return true;}
  if(c=="testalert"){
#if ENABLE_TFT
    tftAlertFlash();
#endif
#if ENABLE_AUDIO
    alertSound(0, "Test alert.");
#endif
    ledBlink();
    Serial.println("Test alert fired (screen + speaker + LED).");return true;}
  return false;
}
void executeCommand(String rawCmd){    // your XOR + history path (kept)
  String cmd=decryptCommand(rawCmd);
  cmd.trim(); String original=cmd; cmd.toLowerCase();
  if(isRepeatCommand(cmd)){Serial.println("Repeat command ignored for safety");return;}
  addToHistory(cmd);
  Serial.printf("Command: %s\n",original.c_str());
  if(cmd.indexOf("spam on")!=-1||cmd.indexOf("shield")!=-1||cmd.indexOf("crowd")!=-1||cmd.indexOf("activate")!=-1){
    activeMode=true; scanningEnabled=true; alertsEnabled=true;
    Serial.println("SHIELD/ACTIVE: detection+alerts ON (active transmit omitted in this build)");
  } else if(cmd.indexOf("scan on")!=-1||cmd.indexOf("passive")!=-1||cmd.indexOf("listen")!=-1){
    scanningEnabled=true; Serial.println("PASSIVE DETECTION ON");
  } else if(cmd.indexOf("off")!=-1||cmd.indexOf("stop")!=-1){
    scanningEnabled=false; activeMode=false; Serial.println("DETECTION PAUSED");
  } else if(cmd.indexOf("status")!=-1){
    logStatusToSD(); Serial.println("Status logged");
  } else Serial.println("Unknown - general order");
}
// non-blocking serial line reader (serialEvent() is unreliable on ESP32)
void pollSerial(){
  static String buf;
  while(Serial.available()){
    char ch=Serial.read();
    if(ch=='\n'){ String line=buf; buf=""; String p=line; p.trim();
      if(!handleReview(p)) executeCommand(line); }
    else if(ch!='\r'){ buf+=ch; if(buf.length()>96) buf=""; }   // overflow guard
  }
}

// ---------------- setup / loop ----------------
void setup(){
  Serial.begin(115200); delay(200);
  randomSeed(esp_random());

  // version-safe task watchdog (kept; IDF5/Arduino-3.x changed the API)
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t wdtc = { 20000, 0, true };
  esp_task_wdt_reconfigure(&wdtc);   // TWDT already inited by Arduino on IDF5
  esp_task_wdt_add(NULL);            // subscribe loop task (ignore if already added)
#else
  esp_task_wdt_init(20, true);
  esp_task_wdt_add(NULL);
#endif

