prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/esp32_surveillance_detector.ino
  if(ALERT_LED_PIN>=0){pinMode(ALERT_LED_PIN,OUTPUT);digitalWrite(ALERT_LED_PIN,LOW);}
  pinMode(BTN_SHIELD_PIN,INPUT_PULLUP);
  pinMode(BTN_STATUS_PIN,INPUT_PULLUP);
  pinMode(BTN_MUTE_PIN,INPUT_PULLUP);

#if ENABLE_TFT
  pinMode(TFT_BL,OUTPUT); digitalWrite(TFT_BL,HIGH);   // backlight on
  SPI.begin(TFT_SCLK,-1,TFT_MOSI,TFT_CS);
  tft.init(240,320);            // ST7789 native 240x320
  tft.invertDisplay(true);      // LAFVIN panel uses inverted colour
  tft.setRotation(3);           // landscape (flip to 1 if upside-down)
  tft.fillScreen(ST77XX_BLACK);
  tftBanner("Pred_Ai booting...",ST77XX_GREEN);
#endif

#if ENABLE_SD
  sdReady=SD.begin(SD_CS_PIN);
  if(sdReady){
    Serial.println("SD OK");
    logFile=SD.open("/guardian.log",FILE_APPEND);
    if(logFile){logFile.println("=== Log Started ===");logFile.close();}
    File f=SD.open(LOG_PATH,FILE_APPEND);
    if(f){if(f.size()==0)f.println("timestamp,lat,lon,type,mac,label,rssi,hits,flags");f.close();}
    loadTable();
  } else Serial.println("SD: not found (serial/TFT only)");
#else
  sdReady=false;
#endif

#if ENABLE_GPS
  gpsSerial.begin(GPS_BAUD,SERIAL_8N1,GPS_RX_PIN,GPS_TX_PIN);
#endif

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA); WiFi.disconnect(true,true);   // station = listen only
  WiFi.setSleep(false); esp_wifi_set_ps(WIFI_PS_NONE);   // no power-save = reliable scans
  BLEDevice::init("");
  pBLEScan=BLEDevice::getScan();
  pBLEScan->setActiveScan(BLE_ACTIVE_SCAN);   // passive = receive-only (no scan requests)
  pBLEScan->setInterval(100); pBLEScan->setWindow(99);

#if ENABLE_AUDIO
  audioInit();
#if ENABLE_VOICE
  if(audioReady) speechSink = new I2SSpeechSink();
#endif
  if(audioReady) audioBoot();    // startup chime confirms the speaker works
#endif

  lastScan = millis() - SCAN_PERIOD;   // scan immediately on boot (no 12s wait)
  lastTFTActivity = millis();
  Serial.println("Guardian Detector ready. Type 'help'.");
}

void loop(){
  esp_task_wdt_reset();
  pollSerial();
  pollButtons();
#if ENABLE_GPS
  while(gpsSerial.available()>0)gps.encode(gpsSerial.read());
  gpsFix = gps.location.isValid() && gps.location.age()<GPS_MAX_AGE_MS;
  if(gpsFix){
    realLat=gps.location.lat(); realLon=gps.location.lng();
    curLat=realLat; curLon=realLon;
  }
#endif
  unsigned long now=millis();
#if ENABLE_TFT
  if(!tftDimmed && now-lastTFTActivity>45000) tftDim();   // dim after 45s idle
#endif
  unsigned long scanEvery = stealthMode ? (SCAN_PERIOD*2) : SCAN_PERIOD;  // stealth = quieter
  if(scanningEnabled && now-lastScan>scanEvery){
    lastScan=now; scanCycle++;
    scanWifi(); performPassiveScan(); saveTable();
#if ENABLE_TFT
    drawScreen();
#endif
  }
  if(now-lastLogTime>8000){logStatusToSD();lastLogTime=now;}
  delay(5);
}
